Repository: xjpz/DevBar
Catalog: DevBar/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en

# ios_settings_hermes_api_key_required
source: 需要 API Key
en: API Key required

# ios_settings_hermes_clear
source: 清除 Hermes 设置
en: Clear Hermes Settings

# ios_settings_hermes_configured
source: 已配置
en: Configured

# ios_settings_hermes_footer
source: Hermes ChatBot 会使用这里的服务器配置从 iPhone 发送消息。
en: Hermes ChatBot uses this server when sending messages from the iPhone app.

# ios_settings_hermes_invalid_url
source: URL 无效
en: Invalid URL

# ios_settings_hermes_save
source: 保存 Hermes 设置
en: Save Hermes Settings

# ios_settings_hermes_saved
source: Hermes 设置已保存
en: Hermes settings saved

# ios_settings_hermes_streaming
source: 流式输出
en: Streaming Output

# ios_settings_high_frequency_summary
source: 高频事件摘要
en: High-Frequency Event Summary

# ios_settings_home_shortcuts_footer
source: 最多选择 4 个。未绑定 Mac 时，Mac 控制类快捷方式不会出现。
en: Choose up to 4. Mac control shortcuts are hidden until a Mac is paired.

# ios_settings_home_shortcuts_section
source: 桌面快捷方式
en: Home Screen Quick Actions

# ios_settings_https_icon_url
source: HTTPS 图标 URL
en: HTTPS Icon URL

# ios_settings_icp_record
source: 鄂ICP备2021013794号-4A
en: Hubei ICP 2021013794-4A

# ios_settings_interval_3m
source: 3 分钟
en: 3 minutes

# ios_settings_interval_5m
source: 5 分钟
en: 5 minutes

# ios_settings_interval_10m
source: 10 分钟
en: 10 minutes

# ios_settings_interval_15m
source: 15 分钟
en: 15 minutes

# ios_settings_interval_30m
source: 30 分钟
en: 30 minutes

# ios_settings_interval_60m
source: 60 分钟
en: 60 minutes

# ios_settings_interval_never
source: 从不
en: Never

# ios_settings_language_en
source: 英文
en: English

# ios_settings_language_section
source: 语言
en: Language

# ios_settings_language_zh_hans
source: 中文
en: Simplified Chinese

# ios_settings_live_activity_enabled
source: 开启灵动岛
en: Enable Dynamic Island

# ios_settings_live_activity_end
source: 结束时间
en: End

# ios_settings_live_activity_hint
source: 在选定时间段内，在锁屏和灵动岛显示已启用 Provider 的额度状态。
en: Shows enabled Provider quota on the Lock Screen and Dynamic Island during the selected time range.

# ios_settings_live_activity_invalid_range
source: 结束时间需要晚于开始时间。
en: End time must be later than start time.

# ios_settings_live_activity_section
source: 灵动岛实时通知
en: Dynamic Island

# ios_settings_live_activity_start
source: 开始时间
en: Start

# ios_settings_live_activity_title
source: 灵动岛
en: Dynamic Island

# ios_settings_live_message_end
source: 结束
en: End

# ios_settings_live_message_placeholder
source: 输入要显示在灵动岛的一句文案
en: Enter a message to show in Dynamic Island

# ios_settings_live_message_section
source: 一句话上岛
en: Quick Island Message

# ios_settings_live_message_start
source: 上岛
en: Start

# ios_settings_navigation_section
source: 导航
en: Navigation

# ios_settings_not_enabled
source: 未启用
en: Disabled

# ios_settings_notifications_section
source: 通知与远程触达
en: Notifications and Remote Reachability

# ios_settings_push_allow_offline
source: 允许离线推送
en: Allow Offline Push

# ios_settings_push_footer
source: 离线通知使用已绑定 Relay iPhone；图标仅支持 HTTPS URL。
en: Offline notifications use the paired Relay iPhone. Icons only support HTTPS URLs.

# ios_settings_push_notifications_section
source: 推送通知
en: Push Notifications

# ios_settings_refresh_hint
source: 在额度页下拉可以强制立即刷新。自动刷新会在 App 再次进入前台且达到所选间隔后执行。
en: Pull down on Usage to force an immediate refresh. Automatic refresh runs when the app becomes active again and the selected interval has elapsed.

# ios_settings_refresh_section
source: 刷新
en: Refresh

# ios_settings_relay_device_name
source: iPhone 名称
en: iPhone name

# ios_settings_relay_device_name_hint
source: 这个名称会发送给已配对 Mac。如果系统只返回“iPhone”，可以在这里设置自定义显示名。
en: This name is sent to the paired Mac. If iOS only exposes “iPhone”, you can set a custom display name here.

# ios_settings_relay_section
source: Mac 中继
en: Mac Relay

# ios_settings_remove_avatar
source: 移除头像
en: Remove Avatar

# ios_settings_select_avatar
source: 选择头像
en: Choose Avatar

# ios_settings_show_webkit_tab
source: 显示 WebKit 标签
en: Show WebKit Tab

# ios_settings_theme
source: 外观
en: Appearance

# ios_settings_theme_dark
source: 深色
en: Dark

# ios_settings_theme_geek
source: 极客
en: Geek

# ios_settings_theme_light
source: 浅色
en: Light

# ios_settings_theme_section
source: 主题
en: Theme

# ios_settings_theme_system
source: 跟随系统
en: Follow System

# ios_settings_time_range_needs_adjustment
source: 时间范围需调整
en: Time range needs adjustment

# ios_settings_title
source: 设置
en: Settings

# ios_settings_user_name
source: 用户名称
en: User Name

# ios_settings_version_label
source: 版本
en: Version

# ios_settings_widget_hint
source: App 刷新额度后会自动写入小组件；如果刚配置完账号，先回到首页触发一次刷新即可。
en: After the app refreshes usage, widget data is written automatically. If you just configured an account, go back to Usage and trigger one refresh first.

# ios_settings_widget_intro
source: 现在可以把 GLM / OpenAI 小组件分别添加到 iPhone 主屏幕。
en: You can now add separate GLM and OpenAI widgets to the iPhone Home Screen.

# ios_settings_widget_section
source: 小组件
en: Widget

# ios_tab_accounts
source: 账号
en: Accounts

# ios_tab_overview
source: 概览
en: Overview

# ios_tab_settings
source: 设置
en: Settings

# ios_tab_tools
source: 工具
en: Tools

# ios_tools_add_header
source: 添加 Header
en: Add Header

# ios_tools_add_query
source: 添加 Query
en: Add Query

# ios_tools_api_debug
source: API 调试
en: API Client

# ios_tools_base64_decode
source: 编码 / 解码
en: Encode / Decode

# ios_tools_clear_response
source: 清空响应
en: Clear Response

# ios_tools_formatter
source: 格式化
en: Formatter

# ios_tools_formatter_compact
source: 压缩
en: Compact

# ios_tools_formatter_decode
source: 解码
en: Decode

# ios_tools_formatter_encode
source: 编码
en: Encode

# ios_tools_formatter_format
source: 格式化
en: Format

# ios_tools_formatter_input
source: 输入
en: Input

# ios_tools_formatter_invalid_input
source: 输入无效
en: Invalid input

# ios_tools_formatter_minify
source: 压缩
en: Minify

# ios_tools_formatter_output
source: 输出
en: Output

# ios_tools_formatter_pretty_print
source: 格式化
en: Pretty Print

# ios_tools_history
source: 历史记录
en: History

# ios_tools_md_delete
source: 删除
en: Delete

# ios_tools_md_docs_title
source: 文档列表
en: Documents

# ios_tools_md_edit
source: 编辑
en: Edit

# ios_tools_md_empty_hint
source: 点击 + 创建新文档
en: Tap + to create a new document

# ios_tools_md_empty_title
source: 暂无文档
en: No Documents Yet

# ios_tools_md_export_copy
source: 复制内容
en: Copy Content

# ios_tools_md_export_file
source: 保存为 .md 文件
en: Save as .md File

# ios_tools_md_export_title
source: 导出 Markdown
en: Export Markdown

# ios_tools_md_preview
source: 预览
en: Preview

# ios_tools_md_search
source: 搜索文档
en: Search Documents

# ios_tools_md_search_empty
source: 未找到匹配的文档
en: No Results

# ios_tools_md_untitled
source: 未命名
en: Untitled

# ios_tools_memo
source: 备忘录
en: Memo

# ios_tools_memo_change_password
source: 修改密码
en: Change Password

# ios_tools_memo_confirm_password
source: 确认密码
en: Confirm Password

# ios_tools_memo_content
source: 内容
en: Content

# ios_tools_memo_decrypt
source: 解密
en: Decrypt

# ios_tools_memo_delete
source: 删除
en: Delete

# ios_tools_memo_destroy_confirm
source: 全部销毁
en: Destroy All

# ios_tools_memo_destroy_message
source: 密码错误已达5次上限，所有备忘录将被永久销毁。
en: Password was incorrect 5 times. All memos will be permanently destroyed.

# ios_tools_memo_destroy_title
source: 销毁所有备忘录？
en: Destroy All Memos?

# ios_tools_memo_edit
source: 编辑
en: Edit

# ios_tools_memo_empty
source: 暂无备忘
en: No memos yet

# ios_tools_memo_empty_hint
source: 点击 + 创建第一条备忘录
en: Tap + to create your first memo

# ios_tools_memo_empty_title
source: 暂无备忘录
en: No Memos Yet

# ios_tools_memo_encrypt
source: 加密
en: Encrypt

# ios_tools_memo_lock
source: 锁定
en: Lock

# ios_tools_memo_password_hint
source: 输入密码
en: Enter password

# ios_tools_memo_password_mismatch
source: 两次密码不一致
en: Passwords do not match

# ios_tools_memo_placeholder
source: 写点什么...
en: Write something...

# ios_tools_memo_remove_password
source: 取消加密
en: Remove Password

# ios_tools_memo_save
source: 保存
en: Save

# ios_tools_memo_search
source: 搜索备忘录
en: Search Memos

# ios_tools_memo_search_empty
source: 未找到匹配的备忘录
en: No Results

# ios_tools_memo_security_warning
source: 连续输错5次密码将永久销毁所有备忘录。
en: 5 consecutive wrong passwords will permanently destroy all memos.

# ios_tools_memo_set_password
source: 设置密码
en: Set Password

# ios_tools_memo_title
source: 标题
en: Title

# ios_tools_memo_unlock
source: 解锁
en: Unlock

# ios_tools_memo_wrong_password
source: 密码错误，剩余 %d 次尝试机会。
en: Incorrect password. %d attempts remaining.

# ios_tools_ocr
source: 文字识别
en: Text Recognition

# ios_tools_ocr_camera
source: 拍照
en: Camera

# ios_tools_ocr_clear
source: 清空
en: Clear

# ios_tools_ocr_empty
source: 未识别到文字
en: No text recognized

# ios_tools_ocr_library
source: 相册
en: Photo Library

# ios_tools_ocr_placeholder
source: 拍照或选择图片开始识别
en: Take a photo or select an image to start

# ios_tools_ocr_recognizing
source: 正在识别...
en: Recognizing...

# ios_tools_ocr_result
source: 识别结果
en: Recognition Result

# ios_tools_qr_bg_color
source: 背景色
en: Background

# ios_tools_qr_code
source: 二维码
en: QR Code

# ios_tools_qr_content
source: 内容
en: Content

# ios_tools_qr_copy
source: 复制到剪贴板
en: Copy to Clipboard

# ios_tools_qr_correction
source: 容错级别
en: Error Correction

# ios_tools_qr_fg_color
source: 前景色
en: Foreground

# ios_tools_qr_save
source: 保存到相册
en: Save to Photos

# ios_tools_qr_saved
source: 已保存
en: Saved

# ios_tools_request
source: 请求
en: Request

# ios_tools_send_request
source: 发送请求
en: Send Request

# ios_tools_speech
source: 语音转文字
en: Speech to Text

# ios_tools_speech_clear
source: 清空
en: Clear

# ios_tools_speech_denied
source: 语音识别权限被拒绝，请在设置中开启。
en: Speech recognition permission denied. Please enable it in Settings.

# ios_tools_speech_listening
source: 正在聆听...
en: Listening...

# ios_tools_speech_mic_denied
source: 麦克风权限被拒绝，请在设置中开启。
en: Microphone permission denied. Please enable it in Settings.

# ios_tools_speech_placeholder
source: 识别结果将显示在这里
en: Recognition result will appear here

# ios_tools_speech_result
source: 识别结果
en: Recognition Result

# ios_tools_speech_tap_start
source: 点击开始录音
en: Tap to start recording

# ios_tools_timestamp
source: 时间戳
en: Timestamp

# ios_tools_translate
source: 翻译
en: Translate

# ios_tools_translate_button
source: 翻译
en: Translate

# ios_tools_translate_clear_input
source: 清空输入
en: Clear Input

# ios_tools_translate_clear_result
source: 清空结果
en: Clear Result

# ios_tools_translate_error
source: 翻译失败，请检查语言对后重试。
en: Translation failed. Please check your language pair and try again.

# ios_tools_translate_input
source: 输入
en: Input

# ios_tools_translate_input_placeholder
source: 输入要翻译的文本
en: Enter text to translate

# ios_tools_translate_result
source: 翻译结果
en: Translation

# ios_tools_translate_result_placeholder
source: 翻译结果将显示在这里
en: Translation will appear here

# ios_transfer_attention_section
source: 注意
en: Attention

# ios_transfer_attention_text
source: 这次导入会覆盖部分本地设置或凭证，请先确认下方受影响的 Provider。
en: This import will overwrite some local settings or credentials. Please confirm the affected providers below.

# ios_transfer_config_add
source: 会把这个 Provider 添加到本地设置中
en: Will add this provider to local settings

# ios_transfer_config_disable
source: 会在本地停用这个 Provider
en: Will disable this provider locally

# ios_transfer_config_enable
source: 会在本地启用这个 Provider
en: Will enable this provider locally

# ios_transfer_config_reorder
source: 会把 Provider 顺序从第 %d 位调整到第 %d 位
en: Will move provider order from #%d to #%d

# ios_transfer_config_unchanged
source: Provider 顺序和启用状态保持不变
en: Provider order and enabled state stay the same

# ios_transfer_description_with_account_id
source: %@。%@。账号标识也会一起变更。
en: %@. %@. Account identifier will also change.

# ios_transfer_device_label
source: 设备
en: Device

# ios_transfer_expires_label
source: 过期时间
en: Expires

# ios_transfer_glm_clear
source: 会清除当前 GLM 凭证
en: Will clear the current GLM credential

# ios_transfer_glm_import_new
source: 会导入 GLM API Key 或浏览器登录态
en: Will import GLM API key or browser session

# ios_transfer_glm_keep_missing
source: 未包含 GLM 凭证
en: No GLM credential included

# ios_transfer_glm_replace
source: 会替换当前 GLM 凭证
en: Will replace the current GLM credential

# ios_transfer_import
source: 导入
en: Import

# ios_transfer_mimo_clear
source: 会清除当前 MiMo Cookie
en: Will clear the current MiMo cookie

# ios_transfer_mimo_import_new
source: 会导入 MiMo Cookie
en: Will import MiMo cookie

# ios_transfer_mimo_keep_missing
source: 未包含 MiMo 凭证
en: No MiMo credential included

# ios_transfer_mimo_replace
source: 会替换当前 MiMo Cookie
en: Will replace the current MiMo cookie

# ios_transfer_openai_clear
source: 会清除当前 OpenAI Access Token
en: Will clear the current OpenAI access token

# ios_transfer_openai_import_new
source: 会导入 OpenAI Access Token
en: Will import OpenAI access token

# ios_transfer_openai_keep_missing
source: 未包含 OpenAI 凭证
en: No OpenAI credential included

# ios_transfer_openai_replace
source: 会替换当前 OpenAI Access Token
en: Will replace the current OpenAI access token

# ios_transfer_providers_section
source: Provider
en: Providers

# ios_transfer_source_section
source: 来源
en: Source

# ios_transfer_title
source: 导入配置
en: Import Config

# ios_transfer_unknown_mac
source: 未知 Mac
en: Unknown Mac

# ios_transfer_will_replace
source: 将被覆盖
en: Will Replace

# language
source: 语言
en: Language

# last_updated
source: 上次更新: %@
en: Last updated: %@

# last_updated %@
source: 上次更新: %@
en: Last updated: %@

# later
source: 稍后
en: Later

# launch_at_login
source: 登录时启动
en: Launch at Login

# live_activity_switch_provider
source: 切换
en: Next

# loading
source: 加载中...
en: Loading...

# log_out
source: 退出登录
en: Log Out

# login_bigmodel
source: 登录 BigModel
en: Login to BigModel

# login_expired
source: 登录已过期，请重新登录
en: Session expired, please log in again

# login_mimo_platform
source: 登录 MiMo 平台
en: Login to MiMo Platform

# low_quota_alert
source: 低额度提醒
en: Low Quota Alert

source: Mac 主题
en: Mac Theme

source: Mac 只显示 Badge，iPhone 不提醒
en: Only show a badge on Mac; do not notify iPhone.

source: Mac 正常提醒，iPhone 不提醒
en: Notify normally on Mac; do not notify iPhone.

source: MCP 权限
en: MCP Permission

# mcp_monthly_quota
source: MCP 每月额度
en: MCP Monthly Quota

# menu_bar_icon
source: 菜单栏图标
en: Menu Bar Icon

source: MiMo 额度
en: MiMo Quota

# mimo_configure_hint
source: 请在设置中配置 MiMo Cookie
en: Configure MiMo cookie in Settings

# mimo_cookie_expired
source: MiMo Cookie 已过期，请在 platform.xiaomimimo.com 重新登录
en: MiMo cookie expired — refresh at platform.xiaomimimo.com

# mimo_cookie_hint
source: 粘贴 platform.xiaomimimo.com 中的 serviceToken 或完整 Cookie。
en: Paste serviceToken or a full Cookie from platform.xiaomimimo.com.

# mimo_cookie_invalid
source: MiMo Cookie 无效
en: Invalid MiMo cookie

# mimo_cookie_login
source: 使用 MiMo Cookie
en: Use MiMo Cookie

# mimo_cookie_placeholder
source: serviceToken 或 Cookie
en: serviceToken or Cookie

# mimo_cookie_renewal_needs_login
source: MiMo 登录已失效，请在设置中重新登录。
en: MiMo login has expired. Sign in again from Settings.

# mimo_cookie_renewal_running
source: 正在后台刷新 MiMo 登录...
en: Refreshing MiMo login in the background...

# mimo_cookie_renewal_success
source: MiMo 登录已于 %@ 刷新
en: MiMo login refreshed at %@

# mimo_cookie_required
source: 请输入 MiMo Cookie
en: Enter MiMo cookie

# mimo_cookie_unchanged_from_browser
source: 浏览器仍是当前 MiMo Cookie。请点击其他页面等待 Token 续签，或重新登录。
en: The browser still has the current MiMo cookie. Open another page and wait for token renewal, or sign in again.

# mimo_monthly_token_quota
source: 月度 Token
en: Monthly Tokens

# mimo_plan_expire_at
source: 有效期至 %@
en: Valid until %@

# mimo_rate_limited
source: MiMo 请求过于频繁，请稍后再试
en: MiMo rate limited, please try again later

# mimo_server_error
source: MiMo 服务暂时不可用，请稍后再试
en: MiMo service temporarily unavailable, please try again later

# mimo_token_plan
source: Token 套餐
en: Token Plan

# minutes_3
source: 3 分钟
en: 3 min

# minutes_5
source: 5 分钟
en: 5 min

# minutes_10
source: 10 分钟
en: 10 min

# minutes_15
source: 15 分钟
en: 15 min

# minutes_30
source: 30 分钟
en: 30 min

# minutes_60
source: 60 分钟
en: 60 min

# network_error
source: 网络错误: %@
en: Network error: %@

# never
source: 从不
en: Never

# new_version_found
source: 发现新版本
en: New version available

# no_data
source: 暂无数据
en: No data

# no_release_found
source: 未找到发布版本
en: No release found

# no_subscription
source: 没有可用套餐
en: No subscription available

# no_update_package
source: 未找到可用的更新包
en: No update package found

# not_detected
source: 未检测到
en: Not Detected

# not_logged_in
source: 未登录
en: Not logged in

# notif_exhausted_title
source: DevBar 额度用尽
en: DevBar Quota Exhausted

# notif_low_quota_title
source: DevBar 额度提醒
en: DevBar Quota Alert

# notif_reset_title
source: DevBar 额度重置
en: DevBar Quota Reset

# notification_permission
source: 通知权限
en: Notification Permission

source: OpenAI 额度
en: OpenAI Quota

# openai_accountid_placeholder
source: 输入 Account ID
en: Enter Account ID

# openai_available_resets_label
source: 可用重置:
en: Available resets:

# openai_configure_hint
source: 请在设置中配置 OpenAI
en: Configure OpenAI in Settings

# openai_daily
source: 每日
en: Daily

# openai_limit_reached
source: 已达到速率限制
en: Rate limit reached

# openai_session
source: %d小时使用限额
en: %dh Usage Limit

# openai_token_invalid
source: OpenAI Access Token 无效，请重新登录或在设置中更新。
en: OpenAI Access Token is invalid. Please sign in again or update it in Settings.

# openai_token_login
source: Access Token登录
en: Access Token Login

# openai_token_placeholder
source: 输入 Access Token
en: Enter Access Token

# openai_token_required
source: 请配置 Access Token
en: Access Token required

# openai_weekly
source: 每周使用限额
en: Weekly Usage Limit

# optional
source: 可选
en: Optional

# or
source: 或
en: or

# other_alerts
source: 其他提醒
en: Other Alerts

# per_hour
source: 每小时
en: Hourly

# per_month
source: 每月
en: Monthly

# per_n_hours
source: 每%1$d小时
en: Every %1$d hours

# per_week
source: 每周
en: Weekly

source: PowerPoint 演示 (.pptx)
en: PowerPoint Presentation (.pptx)

# prevent_sleep
source: 防休眠
en: Prevent Sleep

# prevent_sleep_status_desktop_enabled
source: 防休眠已开启
en: Prevent Sleep is on

# prevent_sleep_status_disabled
source: 防休眠已关闭
en: Prevent Sleep is off

# prevent_sleep_status_portable_closed
source: 已检测到合盖，当前允许休眠
en: Lid is closed, sleep is currently allowed

# prevent_sleep_status_portable_open
source: 防休眠已开启，合盖时会允许休眠
en: Prevent Sleep is on; closing the lid will allow sleep

source: Provider 分页方向
en: Provider Page Direction

# Provider 第 %lld 页，共 %lld 页
source: Provider 第 %1$lld 页，共 %2$lld 页
en: Provider page %1$lld of %2$lld

# provider_ping_api_key_ready
source: GLM API Key 已可用于定时 Ping。
en: GLM API Key is ready for scheduled ping.

# provider_ping_cookie_only_hint
source: 当前为网页登录，自动 Ping 需要 API Key。
en: Current GLM login uses cookies. Scheduled ping requires an API Key.

# provider_ping_failed
source: Ping 失败
en: Ping failed

# provider_ping_last_run
source: 最近成功
en: Last success

# provider_ping_never_run
source: 尚未执行
en: Not run yet

# provider_ping_requires_api_key
source: 需要先配置 GLM API Key 才能启用定时 Ping。
en: Configure a GLM API Key before enabling scheduled ping.

# provider_ping_success
source: Ping 成功
en: Ping succeeded

# provider_ping_test
source: 立即测试 Ping
en: Test Ping

# provider_ping_time
source: 每天
en: Daily at

# provider_ping_title
source: 额度窗口 Ping
en: Quota Window Ping

# quit
source: 退出
en: Quit

# refresh
source: 刷新
en: Refresh

source: Relay 只转发消息和在线状态，Agent 执行与敏感凭证仍保留在 Mac 本地。
en: Relay only forwards messages and online status. Agent execution and sensitive credentials stay local on your Mac.

# relay_disabled_hint
source: 中继已关闭，开启后 iPhone 才能连接这台 Mac。
en: Relay is off. iPhone devices cannot connect to this Mac until it is enabled.

# request_permission
source: 请求权限
en: Request Permission

# reset_at
source: 重置: %@
en: Reset: %@

# restart_now
source: 立即重启
en: Restart Now

# restart_required
source: 需要重启应用以完成安装
en: Restart required to complete installation

# restart_to_apply_language
source: 需要重启应用以应用新的语言设置。
en: The app needs to restart to apply the new language.

# retry
source: 重试
en: Retry

# scan_or_account_login
source: 扫码或账号登录
en: Scan QR code or login with account

# settings
source: 设置
en: Settings

# show_original
source: 显示原文
en: Show Original

# skip_version
source: 跳过此版本
en: Skip this version

# status
source: 状态
en: Status

# subscription_ends
source: 订阅截止
en: Subscription ends

# tab_about
source: 关于
en: About

# tab_accounts
source: 账号
en: Accounts

# tab_general
source: 通用
en: General

# tab_notifications
source: 通知
en: Notifications

# tab_wechat
source: 连接
en: Connect

# tagline
source: 开发吧
en: Dev Bar

# test_connection
source: 测试
en: Test

# testing
source: 测试中...
en: Testing...

# threshold
source: 阈值
en: Threshold

# token_invalid
source: Token 无效，请重新登录
en: Invalid token, please log in again

# token_quota
source: Token 使用额度
en: Token Usage Quota

# translate_to_chinese
source: 翻译为中文
en: Translate to Chinese

# translation_framework_error
source: 翻译服务不可用
en: Translation service unavailable

# translation_timeout
source: 翻译超时，请重试
en: Translation timed out

# unknown_error
source: 未知错误
en: Unknown error

# up_to_date
source: 当前已是最新版本
en: You're up to date

# update_now
source: 立即更新
en: Update Now

# used_percentage
source: 已使用 %1$d%%
en: Used %1$d%%

# version
source: 版本
en: Version

# view_details
source: 查看详情
en: View Details

# wechat_accounts
source: 账号
en: Accounts

# wechat_acp_not_supported
source: ACP 代理类型暂不支持
en: ACP agent type is not yet supported

# wechat_add_account
source: 添加账号
en: Add Account

# wechat_add_agent
source: 添加代理
en: Add Agent

# wechat_add_agent_save
source: 保存
en: Save

# wechat_add_agent_title
source: 添加 AI 代理
en: Add AI Agent

# wechat_agent_api_key
source: API 密钥（可选）
en: API Key (optional)

# wechat_agent_args
source: 参数（空格分隔）
en: Arguments (space-separated)

# wechat_agent_command
source: 命令路径
en: Command Path

# wechat_agent_cwd
source: 工作目录（可选）
en: Working Directory (optional)

# wechat_agent_endpoint
source: 端点 URL
en: Endpoint URL

# wechat_agent_model
source: 模型（可选）
en: Model (optional)

# wechat_agent_name
source: 代理名称
en: Agent Name

# wechat_agent_not_found
source: 未找到代理 '%@'
en: Agent '%@' not found

# wechat_agent_type
source: 代理类型
en: Agent Type

# wechat_agents
source: AI 代理
en: AI Agents

# wechat_config_hint
source: 在 ~/.weclaw/config.json 中配置代理
en: Configure agents in ~/.weclaw/config.json

# wechat_connected
source: 已连接
en: Connected

# wechat_connecting
source: 连接中...
en: Connecting...

# wechat_cwd_access_denied
source: DevBar 无法写入这个目录。
en: DevBar cannot write to this folder.

# wechat_cwd_access_failed
source: 目录访问验证失败
en: Folder Access Failed

# wechat_cwd_choose
source: 选择目录
en: Choose Folder

# wechat_cwd_default_hint
source: 使用 DevBar 默认工作目录
en: Uses DevBar default workspace

# wechat_cwd_missing
source: 目录不存在
en: Folder not found

# wechat_cwd_protected_desktop
source: 桌面
en: Desktop

# wechat_cwd_protected_documents
source: 文稿
en: Documents

# wechat_cwd_protected_downloads
source: 下载
en: Downloads

# wechat_cwd_protected_hint
source: 受保护目录：
en: protected folder:

# wechat_cwd_protected_notice
source: 部分 agent 使用 macOS 受保护目录，首次访问可能需要在 Mac 端授权。
en: Some agents use macOS protected folders. First access may require Mac authorization.

# wechat_cwd_use_default
source: 使用 DevBar 默认工作目录
en: Use DevBar default workspace

# wechat_default_agent
source: 默认代理
en: Default Agent

# wechat_disconnected
source: 未连接
en: Disconnected

# wechat_done
source: 完成
en: Done

# wechat_enable
source: 微信 Bot
en: WeChat Bot

# wechat_invalid_agent_response
source: 代理返回格式无效
en: Invalid agent response format

# wechat_login_hint
source: 用微信扫描二维码登录
en: Scan QR code with WeChat to login

# wechat_login_success
source: 登录成功！
en: Login Successful!

# wechat_login_title
source: 微信登录
en: WeChat Login

# wechat_logs
source: 日志
en: Logs
